backend/app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"