backend/app/controllers/appointment_types_controller.rb

  def index
    @appointment_types = AppointmentType.all
---
SELECT "appointment_types".* FROM "appointment_types"